

import ListStore from './ListStore'
const store = new ListStore('bank');

const defaultState = [
    {"id": 1, "name": "Сбербанк России"},
    {"id": 2, "name": "ВТБ Банк Москвы"},
    {"id": 3, "name": "Газпромбанк"},
    {"id": 4, "name": "ВТБ 24"},
    {"id": 5, "name": "Россельхозбанк"},
    {"id": 6, "name": "ФК Открытие"},
    {"id": 7, "name": "Альфа-Банк"},
    {"id": 8, "name": "Национальный Клиринговый Центр"},
    {"id": 9, "name": "Промсвязьбанк"},
    {"id": 10, "name": "Московский Кредитный Банк"},
    {"id": 11, "name": "ЮниКредит Банк"},
    {"id": 12, "name": "Райффайзенбанк"},
    {"id": 13, "name": "Росбанк"},
    {"id": 14, "name": "Россия"},
    {"id": 15, "name": "БМ-Банк (бывш. Банк Москвы)"},
    {"id": 16, "name": "Рост Банк"},
    {"id": 17, "name": "Банк «Санкт-Петербург»"},
    {"id": 18, "name": "Совкомбанк"},
    {"id": 19, "name": "Московский Областной Банк"},
    {"id": 20, "name": "Ситибанк"},
    {"id": 21, "name": "Банк Уралсиб"},
    {"id": 22, "name": "Ак Барс"},
    {"id": 23, "name": "Русский Стандарт"},
    {"id": 24, "name": "Национальный Банк «Траст»"},
    {"id": 25, "name": "Уральский Банк Реконструкции и Развития"},
    {"id": 26, "name": "Всероссийский Банк Развития Регионов"},
    {"id": 27, "name": "Всероссийский Банк Развития Регионов"},
    {"id": 28, "name": "Российский Капитал"},
    {"id": 29, "name": "СМП Банк"},
    {"id": 30, "name": "Югра"}
];

if (!store.isItUsed()) {
    defaultState.forEach(item => store.setItem(item));
}

export default store;